; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj6 - airport
	obj1 obj3 obj7 - city
	obj4 obj5 obj8 - truck
	obj9 obj16 - airplane
	obj10 obj11 obj12 obj13 obj14 obj15 obj17 - package
)

(:init
	(at obj12 obj2)
	(at obj17 obj6)
	(at obj11 obj0)
	(in-city obj0 obj1)
	(in-city obj6 obj7)
	(at obj13 obj6)
	(at obj16 obj6)
	(at obj8 obj6)
	(at obj9 obj6)
	(at obj14 obj6)
	(at obj15 obj6)
	(at obj10 obj6)
	(in-city obj2 obj3)
	(at obj5 obj0)
	(at obj4 obj2)
)

(:goal (and
	(at obj11 obj2)
	(at obj15 obj0)
	(at obj10 obj2)
	(at obj14 obj0)
	(at obj17 obj2)
	(at obj13 obj2)
	(at obj12 obj0)
))
)

; plan
1. (fly obj9 obj6 obj0)
   deleted: (at obj9 obj6)
   added: (at obj9 obj0)
   goals met: 0 of 7
2. (load obj9 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj9)
   goals met: 0 of 7
3. (load obj16 obj17 obj6)
   deleted: (at obj17 obj6)
   added: (in obj17 obj16)
   goals met: 0 of 7
4. (load obj16 obj15 obj6)
   deleted: (at obj15 obj6)
   added: (in obj15 obj16)
   goals met: 0 of 7
5. (load obj16 obj14 obj6)
   deleted: (at obj14 obj6)
   added: (in obj14 obj16)
   goals met: 0 of 7
6. (load obj16 obj13 obj6)
   deleted: (at obj13 obj6)
   added: (in obj13 obj16)
   goals met: 0 of 7
7. (load obj16 obj10 obj6)
   deleted: (at obj10 obj6)
   added: (in obj10 obj16)
   goals met: 0 of 7
8. (fly obj16 obj6 obj0)
   deleted: (at obj16 obj6)
   added: (at obj16 obj0)
   goals met: 0 of 7
9. (unload obj16 obj15 obj0)
   deleted: (in obj15 obj16)
   added: (at obj15 obj0)
   goals met: 1 of 7
10. (fly obj9 obj0 obj2)
   deleted: (at obj9 obj0)
   added: (at obj9 obj2)
   goals met: 1 of 7
11. (load obj9 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj9)
   goals met: 1 of 7
12. (unload obj9 obj11 obj2)
   deleted: (in obj11 obj9)
   added: (at obj11 obj2)
   goals met: 2 of 7
13. (fly obj9 obj2 obj0)
   deleted: (at obj9 obj2)
   added: (at obj9 obj0)
   goals met: 2 of 7
14. (unload obj9 obj12 obj0)
   deleted: (in obj12 obj9)
   added: (at obj12 obj0)
   goals met: 3 of 7
15. (unload obj16 obj14 obj0)
   deleted: (in obj14 obj16)
   added: (at obj14 obj0)
   goals met: 4 of 7
16. (fly obj16 obj0 obj2)
   deleted: (at obj16 obj0)
   added: (at obj16 obj2)
   goals met: 4 of 7
17. (unload obj16 obj17 obj2)
   deleted: (in obj17 obj16)
   added: (at obj17 obj2)
   goals met: 5 of 7
18. (unload obj16 obj13 obj2)
   deleted: (in obj13 obj16)
   added: (at obj13 obj2)
   goals met: 6 of 7
19. (unload obj16 obj10 obj2)
   deleted: (in obj10 obj16)
   added: (at obj10 obj2)
   goals met: 7 of 7
